content/posts/Whitehead's_conceptual_vocabulary_for_process_philosophy.md
+++
title = "Whitehead's conceptual vocabulary for process philosophy"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:27-04:00
slug = "Whitehead's_conceptual_vocabulary_for_process_philosophy"
draft = false
+++

## [references]({{< relref "references" >}}) {#references--references-dot-md}


### <http://www.philosopher.eu/a-n-whitehead-summary/> {#http-www-dot-philosopher-dot-eu-a-n-whitehead-summary}


### <https://philosophynow.org/issues/114/The%5FPhilosophy%5Fof%5FOrganism> {#https-philosophynow-dot-org-issues-114-the-philosophy-of-organism}


## Concepts {#concepts}


### panpsychism {#panpsychism}


### panentheism {#panentheism}


### actual occasions {#actual-occasions}


### actual entities {#actual-entities}

<!--list-separator-->

-  perspectives on the world analogous to Leibnizian monads


### nexus {#nexus}

<!--list-separator-->

-  aggregates of actual entities


### societies {#societies}

<!--list-separator-->

-  a nexus whose actual entities share a common characteristic


### organisms {#organisms}

<!--list-separator-->

-  complex societies that transmute a plurality of incoming prehensions into an abstract unity for the purpose of minimizing description length and thereby easing comprehension


### concrescence {#concrescence}


### prehension {#prehension}

<!--list-separator-->

-  positive or negative

<!--list-separator-->

-  physical or conceptual

<!--list-separator-->

-  pure and impure


### vectoring {#vectoring}


### dual-aspect theory {#dual-aspect-theory}

<!--list-separator-->

-  external appearance correlates to internal experience


### perceptual mode {#perceptual-mode}

<!--list-separator-->

-  causal efficacy

    <!--list-separator-->

    -  internal experience of the actions and experiences of the past and concurrent surroundings flowing into the present

<!--list-separator-->

-  presentational immediacy

    <!--list-separator-->

    -  sensory impressions


### The nature of God {#the-nature-of-god}

<!--list-separator-->

-  primordial

    <!--list-separator-->

    -  eternal objects

<!--list-separator-->

-  consequent

    <!--list-separator-->

    -  pantheistic unity of all experience drawn into a higher consciousness

<!--list-separator-->

-  God conditions creativity but it is beyond his control
